requests/lyra/line_provision_kurgan_lyra.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:types="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
   <SOAP-ENV:Body>
      <types:SubmitOrderRequest>
         <Components>
            <Component>
               <Attributes>
                  <Attribute>
                     <Name>action_code</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>address</Name>
                     <Value>г. Курган; ул. ЛЕНИНА</Value>
                  </Attribute>
                  <Attribute>
                     <Name>atbr_id</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>cfs_spec_id</Name>
                     <Value>line_provision</Value>
                  </Attribute>
                  <Attribute>
                     <Name>city</Name>
                     <Value>13763</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_date</Name>
                     <Value>2001-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_place</Name>
                     <Value>ГОРОД</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_id</Name>
                     <Value>31459730</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_name</Name>
                     <Value>ОМС КУРГАН ОДИН</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_date</Name>
                     <Value>2014-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_num</Name>
                     <Value>123654</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_place</Name>
                     <Value>ГОРОД</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_ser</Name>
                     <Value>3214</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_phone</Name>
                     <Value>9519364099</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_type</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>connection_scheme</Name>
                     <Value>171</Value>
                  </Attribute>
                  <Attribute>
                     <Name>contract_id</Name>
                     <Value>6559085</Value>
                  </Attribute>
                  <Attribute>
                     <Name>delivery_date</Name>
                     <Value>2015-10-20T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>department_id</Name>
                     <Value>209</Value>
                  </Attribute>
                  <Attribute>
                     <Name>flat</Name>
                     <Value>104</Value>
                  </Attribute>
                  <Attribute>
                     <Name>house</Name>
                     <Value>6</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_date</Name>
                     <Value>2015-10-27T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_interval</Name>
                     <Value>18:00-21:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_order_id</Name>
                     <Value>78005530</Value>
                  </Attribute>
                  <Attribute>
                     <Name>instance_id</Name>
                     <Value>78005530</Value>
                  </Attribute>
                  <Attribute>
                     <Name>jur_eak_id</Name>
                     <Value>34116304</Value>
                  </Attribute>
                  <Attribute>
                     <Name>local_idn_set</Name>
                     <Value>4</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_const_service_id</Name>
                     <Value>23073</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_one_time_service_id</Name>
                     <Value>24736</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_instance_id</Name>
                     <Value>78005530</Value>
                  </Attribute>
                  <Attribute>
                     <Name>need_installation</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>nri_rnabn</Name>
                     <Value>17546458</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_action_type</Name>
                     <Value>PR</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_start_date</Name>
                     <Value>2015-10-20T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>parent_cfs_spec_id</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>password</Name>
                     <Value>78005530</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_amount</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_id</Name>
                     <Value>160317</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>rtpl_id</Name>
                     <Value>53002</Value>
                  </Attribute>
                  <Attribute>
                     <Name>run_billing</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>service_receiver</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_id</Name>
                     <Value>100000</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>street</Name>
                     <Value>302474</Value>
                  </Attribute>
                  <Attribute>
                     <Name>subs_eak_id</Name>
                     <Value>34116304</Value>
                  </Attribute>
                  <Attribute>
                     <Name>tx_id</Name>
                     <Value>336438770</Value>
                  </Attribute>
                  <Attribute>
                     <Name>virtual_number</Name>
                     <Value>143522110918</Value>
                  </Attribute>
                  <Attribute>
                     <Name>zip</Name>
                     <Value>640018</Value>
                  </Attribute>
               </Attributes>
            </Component>
         </Components>
         <CommonData>
            <Attributes>
               <Attribute>
                  <Name>main_virtual_number</Name>
                  <Value>143522110918</Value>
               </Attribute>
            </Attributes>
         </CommonData>
      </types:SubmitOrderRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>